<details ><summary>apply for talos-bootstrap 2025-07-20 03:01:48 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #77
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "zst"
      + file_name               = "talos-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "havnor"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst"
      + verify                  = true
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-1"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "talos-controlplane-1"
      + network_interface_names = (known after apply)
      + node_name               = "havnor"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "talos",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 4
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "10.0.0.50/24"
                  + gateway = "10.0.0.1"
                }
            }
        }

      + memory {
          + dedicated      = 16384
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # talos_machine_configuration_apply.config_apply["controlplane-1"] will be created
  + resource "talos_machine_configuration_apply" "config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + config_patches              = [
          + <<-EOT
                "cluster":
                  "allowSchedulingOnControlPlanes": true
                  "discovery":
                    "enabled": true
                  "network":
                    "cni":
                      "name": "none"
                  "proxy":
                    "disabled": true
            EOT,
        ]
      + endpoint                    = "10.0.0.50"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.0.50"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Creating...
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [1m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [2m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [3m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m10s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m20s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m30s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m40s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [4m50s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Still creating... [5m0s elapsed]
proxmox_virtual_environment_download_file.talos_nocloud_image["havnor"]: Creation complete after 5m9s [id=local:iso/talos-nocloud-amd64.img]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Creating...
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.talos_vm["controlplane-1"]: Creation complete after 20s [id=100]
talos_machine_configuration_apply.config_apply["controlplane-1"]: Creating...
talos_machine_configuration_apply.config_apply["controlplane-1"]: Creation complete after 0s [id=machine_configuration_apply]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

kubeconfig = <sensitive>

```
</details>

</details>